{
  "_name_or_path": "theekshana/deid-roberta-i2b2-NER-medical-reports",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "finetuning_task": "ner",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "O",
    "1": "B-DATE",
    "2": "I-DATE",
    "3": "B-HOSPITAL",
    "4": "I-HOSPITAL",
    "5": "B-PATIENT",
    "6": "I-PATIENT",
    "7": "B-DOCTOR",
    "8": "I-DOCTOR",
    "9": "B-AGE",
    "10": "I-AGE",
    "11": "B-ID",
    "12": "I-ID",
    "13": "B-LOCATION",
    "14": "I-LOCATION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-AGE": 9,
    "B-DATE": 1,
    "B-DOCTOR": 7,
    "B-HOSPITAL": 3,
    "B-ID": 11,
    "B-LOCATION": 13,
    "B-PATIENT": 5,
    "I-AGE": 10,
    "I-DATE": 2,
    "I-DOCTOR": 8,
    "I-HOSPITAL": 4,
    "I-ID": 12,
    "I-LOCATION": 14,
    "I-PATIENT": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.48.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
